{"_id":{"$oid":"5fb00437b9d382068268beb4"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true,"Actors":["Anthony Hopkins","Jodie Foster"]}
{"_id":{"$oid":"5fb118ceb9d382068268beb6"},"Title":"Reservoir Dogs","Description":"Reservoir Dogs is a 1992 American crime film written and directed by Quentin Tarantino in his feature-length debut. It stars Harvey Keitel, Tim Roth, Chris Penn, Steve Buscemi, Lawrence Tierney, Michael Madsen, Quentin Tarantino, and Edward Bunker as diamond thieves whose planned heist of a jewelry store goes terribly wrong. The film depicts the events before and after the heist. Kirk Baltz, Randy Brooks, and Steven Wright also play supporting roles. It incorporates many motifs that have become Tarantino's hallmarks: violent crime, pop culture references, profanity, and nonlinear storytelling.","Genre":{"Name":"Crime","Description":"Films of this genre generally involve various aspects of crime and its detection. Stylistically, the genre may overlap and combine with many other genres, such as drama or gangster film,[1] but also include comedy, and, in turn, is divided into many sub-genres, such as mystery, suspense or noir."},"Director":{"Name":"Quentin Tarantino","Bio":"The best.","Birth":"1963","Death":"-"},"ImagePath":"https://www.imdb.com/title/tt0105236/mediaviewer/rm1533490688?ref_=tt_ov_i","Featured":false}
{"_id":{"$oid":"5fb119b2b9d382068268beb7"},"Title":"Snatch","Description":"Snatch (stylized as snatch.) is a 2000 British crime comedy film written and directed by Guy Ritchie, featuring an ensemble cast. Set in the London criminal underworld, the film contains two intertwined plots: one dealing with the search for a stolen diamond, the other with a small-time boxing promoter (Jason Statham) who finds himself under the thumb of a ruthless gangster (Alan Ford) who is ready and willing to have his subordinates carry out severe and sadistic acts of violence.","Genre":{"Name":"Crime","Description":"Set in the London criminal underworld, the film contains two intertwined plots: one dealing with the search for a stolen diamond, the other with a small-time boxing promoter (Jason Statham) who finds himself under the thumb of a ruthless gangster (Alan Ford) who is ready and willing to have his subordinates carry out severe and sadistic acts of violence."},"Director":{"Name":"Guy Ritchie","Bio":"Guy Stuart Ritchie (born 10 September 1968)[1][2] is an English film director, producer, writer, and businessman. His work includes British gangster films and the Sherlock Holmes franchise.","Birth":"1968","Death":"-"},"ImagePath":"https://www.imdb.com/title/tt0208092/mediaviewer/rm1248859904?ref_=tt_ov_i","Featured":false}
{"_id":{"$oid":"5fb11a3db9d382068268beb8"},"Title":"Lock, Stock and Two Smoking Barrels","Description":"Lock, Stock and Two Smoking Barrels is a 1998 British crime comedy film written and directed by Guy Ritchie, produced by Matthew Vaughn and starring an ensemble cast featuring Jason Flemyng, Dexter Fletcher, Nick Moran, Jason Statham, Steven Mackintosh, Vinnie Jones, and Sting.","Genre":{"Name":"Crime","Description":"A botched card game in London triggers four friends, thugs, weed-growers, hard gangsters, loan sharks and debt collectors to collide with each other in a series of unexpected events, all for the sake of weed, cash and two antique shotguns."},"Director":{"Name":"Guy Ritchie","Bio":"Guy Stuart Ritchie (born 10 September 1968) is an English film director, producer, writer, and businessman. His work includes British gangster films and the Sherlock Holmes franchise.","Birth":"1968","Death":"-"},"ImagePath":"https://www.imdb.com/title/tt0120735/mediaviewer/rm1138956032?ref_=tt_ov_i","Featured":false}
{"_id":{"$oid":"5fb11aecb9d382068268beb9"},"Title":"Step Brothers","Description":"Step Brothers is a 2008 American comedy film directed by Adam McKay, produced by Jimmy Miller and Judd Apatow, and written by Will Ferrell and McKay from a story by Ferrell, McKay, and John C. Reilly. It follows Brennan (Ferrell) and Dale (Reilly), two grown men who are forced to live together as brothers after their single parents, with whom they still live, marry each other. Richard Jenkins, Mary Steenburgen, Adam Scott, and Kathryn Hahn also star.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Adam McKay","Bio":"Adam McKay (born April 17, 1968) is an American screenwriter, director, comedian, and actor. McKay has a comedy partnership with Will Ferrell, with whom he co-wrote the films Anchorman, Talladega Nights, and The Other Guys.","Birth":"1968","Death":"-"},"ImagePath":"https://www.imdb.com/title/tt0838283/mediaviewer/rm3433645824?ref_=tt_ov_i","Featured":false}
{"_id":{"$oid":"5fb11b73b9d382068268beba"},"Title":"Shaun of the Dead","Description":"Shaun (Simon Pegg) doesn't have a very good day, so he decides to turn his life around by getting his ex to take him back, but he times it for right in the middle of what may be a zombie apocalypse. ","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Edgar Wright","Bio":"Edgar Howard Wright (born 18 April 1974) is an English director, screenwriter, producer, and actor. He is best known for his comedic Three Flavours Cornetto film trilogy consisting of Shaun of the Dead (2004), Hot Fuzz (2007), and The World's End (2013), made with recurrent collaborators Simon Pegg, Nira Park and Nick Frost.","Birth":"1974","Death":"-"},"ImagePath":"https://www.imdb.com/title/tt0365748/mediaviewer/rm4187183360?ref_=tt_ov_i","Featured":false}
{"_id":{"$oid":"5fb11bd1b9d382068268bebb"},"Title":"The World's End","Description":"The World's End is a 2013 science fiction comedy film directed by Edgar Wright, written by Wright and Simon Pegg, and starring Pegg, Nick Frost, Paddy Considine, Martin Freeman, Eddie Marsan and Rosamund Pike. The film follows five friends who discover, during an epic pub crawl, that there is an alien invasion in their hometown. ","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Edgar Wright","Bio":"Edgar Howard Wright (born 18 April 1974) is an English director, screenwriter, producer, and actor. He is best known for his comedic Three Flavours Cornetto film trilogy consisting of Shaun of the Dead (2004), Hot Fuzz (2007), and The World's End (2013), made with recurrent collaborators Simon Pegg, Nira Park and Nick Frost.","Birth":"1974","Death":"-"},"ImagePath":"https://www.imdb.com/title/tt1213663/mediaviewer/rm1898371072?ref_=tt_ov_i","Featured":false}
{"_id":{"$oid":"5fb11f19b9d382068268bebc"},"Title":"Django Unchained","Description":"Django Unchained is a 2012 American revisionist Western[4] film written and directed by Quentin Tarantino, starring Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington, and Samuel L. Jackson, with Walton Goggins, Dennis Christopher, James Remar, Michael Parks, and Don Johnson in supporting roles. Set in the Old West and Antebellum South, it is a highly-stylized, heavily-revisionist tribute to Spaghetti Westerns, in particular the 1966 Italian film Django by Sergio  Corbucci, whose star Franco Nero has a cameo appearance.","Genre":{"Name":"Western","Description":"Western is a genre of fiction set primarily in the latter half of the 19th century in the Western United States, which is styled the Old West. Its stories commonly center on the life of a nomadic cowboy or gunfighter[1] armed with a revolver and a rifle who rides a horse."},"Director":{"Name":"Quentin Tarantino","Bio":"The best.","Birth":"1963","Death":"-"},"ImagePath":"https://www.imdb.com/title/tt1853728/mediaviewer/rm958180352?ref_=tt_ov_i","Featured":false}
{"_id":{"$oid":"5fb11f87b9d382068268bebd"},"Title":"Pulp Fiction","Description":"The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","Genre":{"Name":"Crime","Description":"Films of this genre generally involve various aspects of crime and its detection. Stylistically, the genre may overlap and combine with many other genres, such as drama or gangster film,[1] but also include comedy, and, in turn, is divided into many sub-genres, such as mystery, suspense or noir."},"Director":{"Name":"Quentin Tarantino","Bio":"The best.","Birth":"1963","Death":"-"},"ImagePath":"https://www.imdb.com/title/tt0110912/mediaviewer/rm1959546112?ref_=tt_ov_i","Featured":false}
{"_id":{"$oid":"5fb12005b9d382068268bebe"},"Title":"Knocked Up","Description":"A funny movie.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Judd Apatow","Bio":"Judd Apatow was born on December 6, 1967 in Syosset, New York, USA. He is a producer and writer, known for Girls (2012), Knocked Up (2007) and The 40-Year-Old Virgin (2005). He has been married to Leslie Mann since June 9, 1997. They have two children.","Birth":"1967","Death":"-"},"ImagePath":"https://www.imdb.com/title/tt0478311/mediaviewer/rm592592384?ref_=tt_ov_i","Featured":false}
